{"story": "Jill really wanted to write a song for her boyfriend. She compared lyrics from all her favorite bands. She started to write down lyrics but it didn't seem right. After days and days of work her song was finished. Her boyfriend loved it so much!", "genre": "rocstories"}
{"story": "Scott and his class were about to graduate high school. To celebrate they had taken a field trip to the coast. Scott was enjoying his trip but was excited to get it over with. Soon, the trip came to an end. Scott saw this as the official close to his high school story.", "genre": "rocstories"}
{"story": "The man mixed a drink. It tasted very good. His friend asked for one. The man made his friend a drink. His friend gave the drink it's own name.", "genre": "rocstories"}
{"story": "Maggie read a story in the news about a boy raised by wolves. She thought it was a very interesting story. Using the internet, Maggie found similar stories of other people too. She spent the next hour learning about different feral children. By the end, Maggie was an expert on the topic.", "genre": "rocstories"}
{"story": "Kelsi was nervous to go on her first hot air balloon ride. She got some friends together and they went on the balloon. The balloon inched higher in the air and Kelsi tensed up. The view was amazing from high in the air. Kelsi was happy she went on the ride after all.", "genre": "rocstories"}
{"story": ".Sarah suffered from anxiety Her therapist recommended she get a cat. Sarah looked up several likely shelters and visited them. Sarah adopted a cat. Sarah is much less anxious now.", "genre": "rocstories"}
{"story": "Will has always wanted to visit Paraguay but he doesn't speak Spanish. He decides to enroll in a local class. He practices Spanish every day for one year. Now Will is a great Spanish speaker. He feels ready for his trip to Paraguay now that he can speak Spanish.", "genre": "rocstories"}
{"story": "When we went to get on the go carts, we were stopped. The attendee said we had to wear appropriate shoes. My son was wearing flip flops. Thankfully he was kind and let our son borrow his shoes. We said thank you and our son enjoyed the ride.", "genre": "rocstories"}
{"story": "Alex was home sick from school. He awoke to see his Grandma in the kitchen. Alex was happy she came to take care of him. Grandma put Vicks on his chest and gave him ginger ale. Grandma was better than dad at taking care of sick kids.", "genre": "rocstories"}
{"story": "Colin and Jo were having problems in their marriage. Jo felt that Colin worked too much. On the other hand, Colin felt that Jo didn't appreciate his work. After seeing a marriage counsellor, Jo felt that it was too late. She filed for a divorce because she didn't love him anymore.", "genre": "rocstories"}
{"story": "Once upon a time there lived a man. He was alone, and cold, in a rundown apartment complex. Suddenly, there was a loud sound. He was scared because he was all alone and startled. He was relieved when it was just a stray cat making a lot of noise.", "genre": "rocstories"}
{"story": "I took my girlfriend to a new arcade that opened up around the town. When he got inside the place, a bunch of kids were wandering around. We also didn't get the chance to sit down since the place was crowded. The waiter told us to be patient. However, we decided to leave and look for an empty restaurant.", "genre": "rocstories"}
{"story": "I had a task to do. It was very complicated. I could not focus on the task. I drank a cup of coffee to help. I was able to work on the task.", "genre": "rocstories"}
{"story": "Kelly was excited to get a new handbag. She searched everywhere for a black bag. She was very particular. She finally found a Marc Jacobs bag at Bloomingdales. She immediately picked it up.", "genre": "rocstories"}
{"story": "Tim's tooth was hurting like crazy. He could barely eat or drink. His dentist took a look around in his mouth. One of his teeth was rotten. Once the tooth was pulled, Tim felt fine.", "genre": "rocstories"}
{"story": "Tom was dating a girl with a twin. One night they tried to pull a trick on him. They switched places to see if he would notice. Tom noticed right away. He wasn't fooled for even a minute.", "genre": "rocstories"}
{"story": "Hank cried as I tied him to the rails. He called me stupid and some rather profane names. I listened as he sneered that the line had been abandoned for Years. I started to walk away, but paused to look back at Hank. I informed him that of course I knew, no one comes here, at all.", "genre": "rocstories"}
{"story": "Arthur wanted to start impressing girls. He persuaded his mother to buy him a gold necklace. She bought it and he wore the necklace with pride. But it attracted more guys than girls. Finally, a guy with a group of guys snatched it from Arthur's neck.", "genre": "rocstories"}
{"story": "The teacher ran over and turned off the tv. She told us to go back to class. The kids started asking what had happened. She said she wasn't sure but it would be okay. It was years before I understood what we had watched.", "genre": "rocstories"}
{"story": "Sal needed a new car. He had no idea what he wanted. He went to the dealership. He took test drives. Sal now has a better idea.", "genre": "rocstories"}
{"story": "Emily loves chewing on ice. She fills up a cup full of ice every night. The ice got stuck on her finger! She had to rip it off. Now she pours water over the ice before touching it.", "genre": "rocstories"}
{"story": "Anna squeezed into her favorite old jeans. They were a few sizes too small. She managed to zip them, though, so she thought it was okay. But when she crouched later, the jeans ripped! Anna wished she hadn't worn such tight jeans.", "genre": "rocstories"}
{"story": "Avery is going to the zoo for the first time today! When she gets to the zoo, she heads to see the bear first. The bear is nowhere to be found! She finds the bear in the monkey cage where he doesn't belong! She watches as the zookeepers carefully get the bear back to his cage!", "genre": "rocstories"}
{"story": "Sally drives everyday to work. This day was very rainy. The tires on her car were very bald. She had to stop suddenly for a kitten crossing the road. Luckily she stopped in time, but almost hit the kitten.", "genre": "rocstories"}
{"story": "Marion was about to move. She was cleaning her house up before the move. She opened up a closet that had been closed for a year. Inside was a bag with some sort of goo on it. She decided to just leave it.", "genre": "rocstories"}
{"story": "Fatima graduated high school. She decided to go to college. Her grades were not good in high school. She went to a community college and did well. She transferred to a large university.", "genre": "rocstories"}
{"story": "Kat was excited for Christmas. In the weeks before the holiday, she decorated her house. She shopped for gifts for her loved ones. Kat celebrated Christmas with her family and friends. Kat had a fun and festive holiday.", "genre": "rocstories"}
{"story": "Megan was excited for prom. She didn't have a date though. Billy asked Megan if she would like to go to prom with him. She happily accepted his invitation. Billy and Megan went to the prom and had a wonderful time.", "genre": "rocstories"}
{"story": "Tammy and Jane sat down to play a board game. Tammy kept winning each game. They decided to make a rule so Tammy would have a harder time. The next game was much closer. The game after that Jane had won.", "genre": "rocstories"}
{"story": "Susie went to this new restaurant. She was excited to go. All of the sudden though, her order was late. Susie was rather upset. Susie never wanted to go back.", "genre": "rocstories"}
{"story": "He had a craving for chicken. He wanted to try the fast food place he saw. He said he didn't agree with their beliefs. Still, he decided to try it. He ate a grilled chicken sandwich and loved it.", "genre": "rocstories"}
{"story": "Kelly was asked by her neighbors to come babysit. Kelly liked babysitting but the kids were unruly. They were always crying and whining. When Kelly arrived the kids were unbearable. Thankfully they ended up calming down after a snack.", "genre": "rocstories"}
{"story": "Holly wanted to go to the beach. On the way, she stopped and picked up her boyfriend. Once there, they found a secluded spot away from kids playing. Her boyfriend put lotion on her back. After two hours of tanning, they left to have lunch.", "genre": "rocstories"}
{"story": "My wife's coworker came to a party last weekend. She brought her husband. The group sat and talked, her husband a way off. Her husband moved to be closer to her, and she was pleased. He said he moved as he could not hear the conversation.", "genre": "rocstories"}
{"story": "Crystal is a professional babysitter. One day, she had to watch over a pair of rambunctious toddlers. She turned her back for a moment and the kids made a mess. Frustrated, Crystal quickly cleaned up the mess. When the parents got home, Crystal was exhausted from her day.", "genre": "rocstories"}
{"story": "Dan was the team basketball star at his school. This game determined who would go on to state finals. Dan and his team mates played with all their heart. The game was tied when Dan shot the last basket hoping to make it. The team won by two points and went on to state finals.", "genre": "rocstories"}
{"story": "My friends and I decided to drive to a music festival 3 hours away. After the show we decided not to get a hotel room. The hotel rooms available were either expensive or not clean. So we decided to just forgo sleep and just drive home. We talked and laughed the entire drive and had a great time.", "genre": "rocstories"}
{"story": "Jane's cat ran out the door one day. She went out looking for him. After an hour she went back home. Her cat was waiting by the door for her. Jane laughed a bit and let him in.", "genre": "rocstories"}
{"story": "Carla was enjoying her nutritional drink. She told Janice to try out the drink. Janice had a sip and gave a good comment on it. Unfortunately, she caught a bad stomach ache an hour later. She was stuck in the bathroom for a while.", "genre": "rocstories"}
{"story": "A thief tried to approach an old lady in the street. He didn't realize that she's a kung fu mentor. She was able to knock him out. He fell on the floor. The police officers came and tool him to jail.", "genre": "rocstories"}
{"story": "Allie went to the drive in. But she got bored. So she took out her phone. But there was no service. She was very annoyed.", "genre": "rocstories"}
{"story": "Cathy loved to play tennis. However, her serve was terrible. She finally decided to start taking lessons. Her swing started to show improvement. Cathy was glad she was able to hit better.", "genre": "rocstories"}
{"story": "My niece has a 12-year old daughter, Mary. Mary wanted a pet guinea pig. Her mom bought her two. They had six babies. My niece just bought a huge cage to house the guinea pigs.", "genre": "rocstories"}
{"story": "I used to use a lawn service to fertilize my grass. After 2 years, I was still getting weeds and clover. I figured out how much I had paid the service over the years. It really was cheaper to fertilize my own lawn. My lawn looks a lot better now.", "genre": "rocstories"}
{"story": "Tina moved into the new apartment complex. She had just finished unpacking when she heard some noise. She then saw a mouse scurrying to hide in the bathroom. Tina promptly called the landlord. The landlord called the exterminators to fumigate the unit.", "genre": "rocstories"}
{"story": "Jessica was redoing her kitchen. She found some beautiful rugs. She spread them out on her kitchen floor. They were exactly what the room had been missing! She couldn't wait to move on to the rest of the house.", "genre": "rocstories"}
{"story": "Jane went to an attorney to get a divorce from Jack. The lawyer was polite but informed her she would lose a lot. Jane decided to take a day to think about it. She called the lawyer a week late and told him to proceed. A week later Jack signed the papers somberly.", "genre": "rocstories"}
{"story": "I was rushed into my dental appointment yesterday. I apologized to my dentist for not having time to brush my teeth. He shrugged and gave me a big smile. He said he didn't have time to wash his hands after peeing. I hope he was joking on that one.", "genre": "rocstories"}
{"story": "Leah is nervous about her flight while she waits in the terminal. A man comes up and starts hitting on her. Luckily for Leah, she doesn't have to sit next to him on the flight. She deplanes, and he begins hitting on her again. Leah lets him down and quickly leaves.", "genre": "rocstories"}
{"story": "Annie was shopping with friends. She decided to try to steal some clothes. On her way out of the mall she was caught by security. They banned her from the mall for one year. Annie was so sad but her friends vowed to wait it out with her.", "genre": "rocstories"}
{"story": "Tammy woke up one morning before school. She needed to put on her eye makeup but she had some type of sore. She tried several times but couldn't put on her eye makeup. Instead she decided to go to school without it. She ended up loving it and adopted it as her permanent look.", "genre": "rocstories"}
{"story": "Lucy got her nails professionally done. She loved the way they looked. However to her surprise she realized she chipped one. It ruined the entire nail. Lucy went back and had it re done.", "genre": "rocstories"}
{"story": "Samantha lived by herself in a studio apartment. She got a bill in the mail saying her rent would be increased. Her rent would be increased from $800 a month to $1600. Samantha couldn't afford the rent increase. Samantha had to move to a cheaper apartment.", "genre": "rocstories"}
{"story": "I was over at my friend's house last week I noticed he had money laying out and took it. He confronted me about it the next day. I denied everything even though he knows it was me. I lost a friendship but gained fifty bucks.", "genre": "rocstories"}
{"story": "Dirk traveled to Japan in early 2013. When there, he visited all sorts of places. He got lost one day, and was unable to find his way back to his hotel. He looked to the skyline and followed familiar buildings. Eventually he found his hotel, after hours of walking.", "genre": "rocstories"}
{"story": "Trevor got his motorcycle license. He'd just bought a motorcycle and couldn't wait to ride it. He went to the dealership and picked up the keys. He drove it home right away. He loved his new bike!", "genre": "rocstories"}
{"story": "Jane worked hard on the big project at work. She needed, but had no help. She hurried to prepare everything Somehow she managed to finish on time. She was relieved when her boss was impressed by her work.", "genre": "rocstories"}
{"story": "Tom was out on a date. He was trying to impress the girl. Tom ordered expensive items even though he couldn't afford them. He severely overdrafted his account. Tom spent weeks paying it off.", "genre": "rocstories"}
{"story": "Ned was drinking one night. He decided to drive home from the bar. He thought he was sober enough to make it home. But Ned had overestimated himself. He crashed into a tree two blocks away from the bar.", "genre": "rocstories"}
{"story": "Tim had smoked for many Year's. He really wanted to quit! So he bought special gum and patches to help him. It was hard, but he persevered. In a few months he had quit for good!", "genre": "rocstories"}
{"story": "Last night there were three homicides in the city of Dallas, Texas. Lisa and Monica are sisters who lost their brother and sister in law. Someone robbed the pair and shot them in their home. Two blocks away, a teenager was shot and killed outside of a store. Police think that all three murders were committed by the same person.", "genre": "rocstories"}
{"story": "Trina decided to enroll into beauty school. After her first week, she was allowed to cut and dye people's hair. An elderly woman came in, and Trina accidentally dyed her hair pink! Trina apologized to the elderly woman, but she just laughed. She slipped Trina a tip, and told her she made her feel younger.", "genre": "rocstories"}
{"story": "A hunter was in his hunter's stand in the woods. A bear had approached his stand slowly, with curiosity. The hunter was extremely nervous and lifted his gun. To his horror, the bear climbed the tree and sniffed around the hunter The hunter decided to stay still until the bear left.", "genre": "rocstories"}
{"story": "Jo was selected to appear on a TV game show. She travelled to Hollywood to appear on the show. Jo played the game but soon found herself losing badly. After the final round, Jo came in last place. Jo was upset she lost, but the experience was very fun and memorable.", "genre": "rocstories"}
{"story": "May moved with her parents to a new city. May was nervous about making new friends in her neighborhood. One day a girl came over and asked May to play with her. May agreed and they spent the day together. Now May and the girl are best friends and May loves her new home.", "genre": "rocstories"}
{"story": "Ronald needed new shoes. So Ronald went to the shoe store. Ronald looked for the right shoes. He found the right shoes. Ronald got the shoes and bought it.", "genre": "rocstories"}
{"story": "Kara was on a diet. She had lost a lot of weight. Kara's waist was getting smaller. Her clothes weren't fitting anymore. Kara had to buy new clothes.", "genre": "rocstories"}
{"story": "Gina wanted to marry a rich man. So she frequented a rich neighborhood to attract one. While on the subway to get there, she met Matt. He was poor, but her heart started to beat faster. She gave up her dream to marry a rich man to marry love instead.", "genre": "rocstories"}
{"story": "Alex awoke when the sun rose. She realized she had forgotten to close the shades. She decided to get up since she was already awake. She took an extra long shower because she had the time to. Alex left her house early with a plan to get to work early.", "genre": "rocstories"}
{"story": "Harry was afraid of heights. His friends convinced him to hang glide. Harry set up life insurance. He jumped off the cliff. He flew into a building.", "genre": "rocstories"}
{"story": "Me and my girlfriend have been dating for a year now. But it seems every time we take two steps forward. The devil makes us go two steps back. LAbor day weekend i put my phone down for a second. My girlfriend seen the texts in my phone and now we over.", "genre": "rocstories"}
{"story": "Every year my in-laws take my family to Disney World. We stay at one of the resorts right on the grounds. We visit the parks and stay late every night. By the end of the week we are all exhausted and ready to go home. But we are always ready to go back when the next year rolls around.", "genre": "rocstories"}
{"story": "I wanted to go to the movies, and meet up with my friends. My mother said if I finished my chores, she would drop me off. I started to get ready and before I knew it, it was time to go. My mother said, you're not finished with your choirs. I never went, being so excited to get ready, I didn't finish my chores.", "genre": "rocstories"}
{"story": "Shane decided to cook some dinner. He made homemade macaroni and cheese. He loved mixing the melted cheese together. He crumbled some bacon on top. It was his secret recipe and it was delicious!", "genre": "rocstories"}
{"story": "I had been wanting a new dog. My current dog was getting old and needed a companion. I had no idea what I wanted. I decided to go to the animal shelter and look around. While there I fell in love with a puppy and took her home.", "genre": "rocstories"}
{"story": "Cathy went to the doctor to get her foot checked out. The doctor's examination showed that the foot was broken. Cathy had to drive to the orthopedist's office to get a cast. Cathy found it very hard to driving home with a cast. Once she was home she sat in a chair and didn't move for 5 hours.", "genre": "rocstories"}
{"story": "The family lives down the road from a park. The kids ask Becky to take them there. Becky takes the kids to park to play. They all have a fun time. They can't wait to go again.", "genre": "rocstories"}
{"story": "Matthew wanted to got trick or treating with his friend Micah. Micah already had plans to go trick or treating with his cousins. Matthew's mom suggested Mathew try calling Jack. Jack agreed to trick or treat with Matthew. Jack and Matthew collected lots of candy.", "genre": "rocstories"}
{"story": "Cynthia loved staying indoors, she rarely left her home. She often broke down in public places minutes after leaving her house. She was diagnosed with social anxiety and needed medicine to go out. She finally decided to see a shrink about her debilitating condition. She got better within days and now shops for herself every day.", "genre": "rocstories"}
{"story": "Justin is with his friend Bill looking for clubs. Justin is tired from trying to find clubs. Bill keeps trying to find the hottest club in town. They eventually give up and waste their whole night on nothing. On the way home with no sleep Justin falls asleep while driving.", "genre": "rocstories"}
{"story": "Laura chatted with her friends online everyday. And eventually, she became really good at typing. She entered a typing contest. And everyone was amazed at how she could type 320 words per minute. She won 1st place and chatted online the rest of the day about it.", "genre": "rocstories"}
{"story": "Travis grew up in a fishing village. The village was running low on fish. Travis set out to find the biggest catch of fish. After three days at sea, Travis had a huge catch. Travis returned to the village as a hero.", "genre": "rocstories"}
{"story": "A little boy played with a ball alone. Someone brought a little girl into the room with him. She wanted to play with the ball and he was afraid to let her. However he allowed her to play with the ball as well. They continued to play until they went home, not alone anymore.", "genre": "rocstories"}
{"story": "The soda hit the ground hard. She sighed in frustration that she had ruined it. Picking it up, she put it back in the car. Later she went to get a soda. She forgot, and it fizzed all over her.", "genre": "rocstories"}
{"story": "Mikey was looking for a part-time job. Mikey searched online for places to work. He noticed a local gas station for hiring for the night shift. Mikey sent his resume on the company's website. Mikey rejoiced when he landed an interview.", "genre": "rocstories"}
{"story": "Becky and her brother Tim were picking out pumpkins. They were going to carve Jack-O-Lanterns. Becky tried to tell Tim which pumpkin to pick. Tim didn't agree and they started fighting over a large pumpkin. Their parents soon stepped in and decided the big one was theirs.", "genre": "rocstories"}
{"story": "Kelly and her friends went on a trip to Dubai. The girls were so excited. The only problem was the long flight. The girls were on the plane for fifteen hours. They couldn't wait to land.", "genre": "rocstories"}
{"story": "Carlos has always been proud of his thick black hair. Unfortunately, he sees that his hair has started to develop dandruff. Carlos goes to the store to buy a special anti-dandruff shampoo. Gradually the dandruff begins to go away. Carlos can finally be proud of his hair again.", "genre": "rocstories"}
{"story": "I was a Brockton Rox fan. They played minor league baseball in Brockton, MA. I saw them play three times. Once I saw El Guapo, a former Red Sox, pitch. I was sad to see the Rox leave pro baseball.", "genre": "rocstories"}
{"story": "Tyler wanted to see a movie with his friends. But none of them could agree on which film to see. At the theater, they were still arguing! So they decided that each guy would see a separate film. They each ended up seeing the movie they wanted to see, alone!", "genre": "rocstories"}
{"story": "Leroy had a clever idea. He couldn't afford to practice at the batting park. He bought a t-shirt cannon. Leroy leaned back and wound up with his wiffle ball bat. He swung and knocked a t-shirt into the next room.", "genre": "rocstories"}
{"story": "James flew for the first time in his life. He was very scared. The plane experienced some turbulence. James panicked and started to scream. A flight attendant had to calm him down.", "genre": "rocstories"}
{"story": "Angie was in a bad marriage. She decided it was time to leave her husband. It was the hardest choice she ever made. The first few days was so rough. Angie finally figured out it was the best decision she made.", "genre": "rocstories"}
{"story": "Tina was being bullied at her job. She reported it to her supervisor. Her supervisor did not believe her. Tina hired a lawyer. Tina sued her employer.", "genre": "rocstories"}
{"story": "Gemini had a scar on his left cheek. He was bullied both for his name and his scar. Gemini went to the county office and had his name changed to Jim. Then he bought some makeup to cover up his scar. Now he lives a quiet, nondescript life, and he loves it.", "genre": "rocstories"}
{"story": "Arra went to the market for strawberries. But there was such a big selection of fresh fruit! She could not resist buying melons and peaches too. She brought all her finds home in her basket. Arra and her family ate fruit every day for a week!", "genre": "rocstories"}
{"story": "There was a boy in a choir who was very rude. He constantly talked while the Director was speaking. The Director asked him if he would like to come up front. It was not as easy to lead a choir as he had thought. The boy was more subdued when he went back to his seat.", "genre": "rocstories"}
{"story": "Bob was walking to his house. He found some money on the street. He decided to turn it into the police station. After thirty days, no one claimed the money. Bob got to keep the money.", "genre": "rocstories"}
{"story": "Mark was addicted to gambling. He had just gotten his paycheck. Mark went to the casino. He wasted half of his pay gambling. Mark fell behind on his monthly bills.", "genre": "rocstories"}
{"story": "Kyle often forgot his clothes at the laundromat. The owner warned him they would be donated if he left them again. Kyle did not want his clothes to be taken away. So he decided to be more attentive and wait for his clothes to finish. Kyle never left any clothes unattended in the laundromat again.", "genre": "rocstories"}